// Задайте строку, содержащую латинские буквы в обоих регистрах. Сформируйте строку, 
// в которой все заглавные буквы заменены на строчные.

string str = "aBcD1ef!-";
string LowStr = str.ToLower();
Console.WriteLine(LowStr);

//string UpStr = str.ToUpper();
//Console.WriteLine(UpStr);
